# Chapter 5. Getting Started with pandas

We will spend much of the remaining time on the *pandas* library. pandas offers much of the same idioms from NumPy, designed for tabular data. Although newer paradigms such as *polars* and *DuckDB* have shown faster processing time and more efficient memory management, pandas remains the dominant tool for data analysis. Therefore, it is critical to master pandas before moving on to other tools.

In [2]:
# Setting up for the chapter
import numpy as np 
import pandas as pd 
from pandas import Series, DataFrame

## Series

pandas *Series* is a one-dimensional array, with an indexed data label called *index*. Series has a `array` and an `index` attribute.

In [3]:
my_series = pd.Series([4, 7, -3.5, 3])
print(my_series.array)
print(my_series.index)

my_series2 = pd.Series([4, 7, -3.5, 3], index=['a', 'b', 'c', 'd'])

# selecting by index
my_series2['b']
my_series2[['b', 'd']]

# Boolean selection
my_series2[np.abs(my_series2) > 3]

# algebra
np.exp(my_series2)

# test whether an index exists
'b' in my_series2 # True

<NumpyExtensionArray>
[4.0, 7.0, -3.5, 3.0]
Length: 4, dtype: float64
RangeIndex(start=0, stop=4, step=1)

True

In [4]:
# Series is basically a dict
pop_dict = {'Ohio': 35_000, 'New York': 1_300_000, 'California': 23_000_000, 'Oregon': 12_000}
pop = pd.Series(pop_dict)
pop_todict = pop.to_dict()

# re-index
states = ['Ohio', 'New York', 'California', 'Utah']
pop2 = pd.Series(pop_dict, index=states)
pd.isna(pop2)
pop2['Utah'] = np.nan
pd.notna(pop2)
pop + pop2

California    46000000.0
New York       2600000.0
Ohio             70000.0
Oregon               NaN
Utah                 NaN
dtype: float64

In [5]:
# Both Series and index have a name attribute
pop.name = "Population"
pop.index.name = "State"
pop

State
Ohio             35000
New York       1300000
California    23000000
Oregon           12000
Name: Population, dtype: int64

In [6]:
print(pop2.to_string)

<bound method Series.to_string of Ohio             35000.0
New York       1300000.0
California    23000000.0
Utah                 NaN
dtype: float64>

In [7]:
pop2

Ohio             35000.0
New York       1300000.0
California    23000000.0
Utah                 NaN
dtype: float64

## DataFrame

A DataFrame is a rectangular table to data, containing ordered, named collection of columns. Each column can be of different data type. DataFrame has both row and column index.

One common way to construct a DataFrame is from a dictionary of equal-length lists or np.array.

In [8]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [9]:
df.head(3)
df.tail(3)
df.describe()

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [10]:
# re-order the cols
df2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])
df2.head(2)
df2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [11]:
df2['state']
df2.pop # naming conflict, so it doesn't work

<bound method DataFrame.pop of    year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN>

In [12]:
# label-based versus integer-based indexing
df2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [13]:
df2.iloc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [14]:
df2.debt = 100 * np.random.uniform(size=len(df2))
df2

   year   state  pop       debt
0  2000    Ohio  1.5  92.315884
1  2001    Ohio  1.7  27.443521
2  2002    Ohio  3.6   0.281641
3  2001  Nevada  2.4  67.511035
4  2002  Nevada  2.9  78.466919
5  2003  Nevada  3.2  99.560537

In [15]:
df2['new col'] = df2['state'] == "California"
del df2['new col']
df2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

> Another common way to construct DataFrame is from a nested dictionary of dictionaries. In this case, the outer dictionary keys are treated as columns, while the inner keys are set as rows.

You can also transpose a DataFrame. However, transpose discards the column data types if the columns don't all hae the same data type. So transposing and then transposing again may not give you back the same data.

In [16]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}
pop3 = pd.DataFrame(populations)
pop3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [17]:
pop3.index.name = 'year'
pop3.columns.name = 'state'

In [18]:
# to_numpy() method converts df to np.array
arr = pop3.to_numpy()

In [19]:
# extract index object
row_ind = pop3.index

# Reset index
pop4 = pop3.copy()
new_idx = pd.Index(np.arange(3)) # create an index object
pop4.index = new_idx # reset the index
pop4.index is new_idx # test index

True

In [20]:
pop3.index

Index([2000, 2001, 2002], dtype='int64', name='year')

In [21]:
# Reindexing
df = pd.DataFrame({'color': ['blue', 'purple', 'red'], 'size': [12, 20, 30]}, index=[0, 2, 4])
df2 = df.reindex(index=np.arange(6), method='ffill')
type(df2)
df2

    color  size
0    blue    12
1    blue    12
2  purple    20
3  purple    20
4     red    30
5     red    30

In [22]:
df = pd.DataFrame(np.arange(9).reshape((3, 3)),
                  index=['a', 'c', 'd'],
                  columns=['OH', 'NJ', 'CA'])
df2 = df.reindex(index=['a', 'b', 'c'])

df3 = df.reindex(columns=['OH', 'NJ', 'NY'])

# You can also use .loc to reindex, but all rows and cols must exist
df4 = df.loc[['a', 'd', 'c'], ['OH', 'NJ']]
df4

   OH  NJ
a   0   1
d   6   7
c   3   4

In [23]:
# Drop entries from an axis
df = pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=['OH', 'NJ', 'NY', 'CA'],
                  columns=['v1', 'v2', 'v3', 'v4'])
df.drop(['NJ', 'NY'])
df.drop(['v2', 'v1'], axis='columns')

    v3  v4
OH   2   3
NJ   6   7
NY  10  11
CA  14  15

In [24]:
# Indexing, selection, and filtering
df[0:2]
df.loc['OH':'NJ']
df.loc[['OH','NY']]

    v1  v2  v3  v4
OH   0   1   2   3
NY   8   9  10  11

In [25]:
df.iloc[[1, 2, 3]] # the inner [] is a list
df.iloc[1:3] # slicing
df.loc['OH':'NY'] # slicing is inclusive

    v1  v2  v3  v4
OH   0   1   2   3
NJ   4   5   6   7
NY   8   9  10  11

In [26]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
# chained operation
data.iloc[:, :3][data['three'] > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [28]:
# to select a single cell
data.at['Colorado','two']
data.iat[0,2]

np.int64(2)

In [29]:
ser = pd.Series(np.arange(5))
ser.iloc[-1]
ser.iloc[0:2]

0    0
1    1
dtype: int64

In [30]:
data.loc[data['three'] == 6, 'three'] = 100
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5    100     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])

# Reindex df1 using index & columns from df2
df1.reindex(index=df2.index, columns=df2.columns, fill_value=0)

# Add df1 and df2, with NaN filled with 0
df1.add(df2, fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [32]:
df1.reindex_like(df2)

          b    d   e
Utah    NaN  NaN NaN
Ohio    0.0  2.0 NaN
Texas   3.0  5.0 NaN
Oregon  NaN  NaN NaN

In [33]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [34]:
ser_c = df1['c']
ser_c

Ohio        1.0
Texas       4.0
Colorado    7.0
Name: c, dtype: float64

In [35]:
# broadcasting is by default matched by columns
df1 - ser_c

          Colorado  Ohio  Texas   b   c   d
Ohio           NaN   NaN    NaN NaN NaN NaN
Texas          NaN   NaN    NaN NaN NaN NaN
Colorado       NaN   NaN    NaN NaN NaN NaN

In [36]:
# You would have to specify if it's match by rows
df1.sub(ser_c, axis='index')

            b    c    d
Ohio     -1.0  0.0  1.0
Texas    -1.0  0.0  1.0
Colorado -1.0  0.0  1.0

In [ ]:
# Function application and mapping 
df = pd.DataFrame(np.random.standard_normal((4,3)),
                columns=list("abc"),
                index=['NY', 'NJ', 'CT', 'MA'])
df = df.abs() # use DataFrame methods
df['max_col'] = df.max(axis=1) # compute and assign at the same time
df['max_col_idx'] = df.idxmax(axis=1) # argmax in DataFrame
df

           a         b         c   max_col max_col_idx
NY  2.024428  2.045707  0.080059  2.045707           b
NJ  0.981457  0.302607  0.141950  0.981457           a
CT  0.641849  0.838829  0.389253  0.838829           b
MA  0.745269  0.009416  1.745864  1.745864           c

In [52]:
# apply custom func
def compute_range(df):
    return df.max() - df.min()

In [58]:
df = pd.DataFrame(np.random.standard_normal((4,3)),
                columns=list("abc"),
                index=['NY', 'NJ', 'CT', 'MA'])
df['range'] = df.apply(compute_range, axis=1)
df

           a         b         c     range
NY  0.596959 -0.277709  1.371555  1.649264
NJ  0.506321 -1.160368  0.972151  2.132519
CT -0.709171 -0.917476  0.694475  1.611950
MA -0.198459 -0.605705 -1.191940  0.993481

In [70]:
df = pd.DataFrame(np.random.standard_normal((4,3)),
                columns=list("abc"),
                index=['NY', 'NJ', 'CT', 'MA'])
df[['min', 'max']] = df.agg(['min', 'max'], axis=1)
df

           a         b         c       min       max
NY -0.894726 -0.354213 -1.057048 -1.057048 -0.354213
NJ -0.422694  0.225005  0.347619 -0.422694  0.347619
CT  0.667620 -1.293929 -1.608622 -1.608622  0.667620
MA -0.719244 -0.297146 -0.207168 -0.719244 -0.207168

In [71]:
def my_format(x):
    return f"{x:.2f}"

In [72]:
df.applymap(my_format)

C:\Users\yluo\AppData\Local\Temp\ipykernel_27892\1310662920.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(my_format)

        a      b      c    min    max
NY  -0.89  -0.35  -1.06  -1.06  -0.35
NJ  -0.42   0.23   0.35  -0.42   0.35
CT   0.67  -1.29  -1.61  -1.61   0.67
MA  -0.72  -0.30  -0.21  -0.72  -0.21

In [78]:
df2 = df.sort_index(axis=1, ascending=False)

In [79]:
df2

         min       max         c         b         a
NY -1.057048 -0.354213 -1.057048 -0.354213 -0.894726
NJ -0.422694  0.347619  0.347619  0.225005 -0.422694
CT -1.608622  0.667620 -1.608622 -1.293929  0.667620
MA -0.719244 -0.207168 -0.207168 -0.297146 -0.719244

In [81]:
df.sort_values('a')

           a         b         c       min       max
NY -0.894726 -0.354213 -1.057048 -1.057048 -0.354213
MA -0.719244 -0.297146 -0.207168 -0.719244 -0.207168
NJ -0.422694  0.225005  0.347619 -0.422694  0.347619
CT  0.667620 -1.293929 -1.608622 -1.608622  0.667620

In [ ]:
df = pd.DataFrame(np.arange(12,0,-1).reshape(4,3),
                columns=list("abc"),
                index=['NY', 'NJ', 'CT', 'MA'])
df.sort_values('a')

     a   b   c
MA   3   2   1
CT   6   5   4
NJ   9   8   7
NY  12  11  10

In [88]:
df

     a   b   c
NY  12  11  10
NJ   9   8   7
CT   6   5   4
MA   3   2   1

In [95]:
rng = np.random.default_rng(42)
df = pd.DataFrame(rng.standard_normal((4,3)),
                columns=list("abc"),
                index=['NY', 'NJ', 'CT', 'MA'])
df

           a         b         c
NY  0.304717 -1.039984  0.750451
NJ  0.940565 -1.951035 -1.302180
CT  0.127840 -0.316243 -0.016801
MA -0.853044  0.879398  0.777792

In [96]:
df.rank(axis=0)

      a    b    c
NY  3.0  2.0  3.0
NJ  4.0  1.0  1.0
CT  2.0  3.0  2.0
MA  1.0  4.0  4.0

In [100]:
ser = pd.Series(np.arange(5), index = ['a', 'a', 'b', 'b', 'c'])
ser.index.is_unique
ser['a']

a    0
a    1
dtype: int64

# Summarizing and Computing Descriptive Statistics

There are many built-in summary statistics functions in pandas, which typically have better ways to handle missing values (`skipna=True`). They also allow you to compute summary statistics either by rows (axis=0) or across columns (axis=1). For multi-level data, there is also an argument for `level`.
- Unlike base Python, `argmax` and `argmin` are replaced with `idxmax` and `idxmin`.
- For most functions, you can only compute for numeric columns, so you need to specify `numeric_only=True`.
- for `describe()` method, you can compute summary statistics for `include='number'` (numeric columns), `object` (text/categorical), `bool` (Boolean), `datatime`, or `all`.

Here is a list of common methods:
- `count` computes number of non-NA values
- `describe`
- `min`, `max`, `idxmin`, `idxmax`
- `sum`, `prod`, `mean`, `median`, `mad`, `var`, `std`, `skew`, `kurt`
- `quantile` (default: 0.5)
- `cumsum`, `cummin`, `cummax`, `cumprod`
- `diff` (first difference, useful for time series)
- `pct_change`

In [111]:
# df with missing values
df = pd.DataFrame(
    [[1.4, np.nan, 'M'], [7.1, -4.5, 'F'], [np.nan, np.nan, 'M'], [0.75, -1.3, 'M']],
    index=["a", "b", "c", "d"],
    columns=["one", "two", "gender"],
)
df

    one  two gender
a  1.40  NaN      M
b  7.10 -4.5      F
c   NaN  NaN      M
d  0.75 -1.3      M

In [121]:
df.sum(axis=1, skipna=True, numeric_only=True)
df.idxmax(axis=1, numeric_only=True)
df.describe(include='all')

C:\Users\yluo\AppData\Local\Temp\ipykernel_27892\1626247040.py:2: FutureWarning: The behavior of DataFrame.idxmax with all-NA values, or any-NA and skipna=False, is deprecated. In a future version this will raise ValueError
  df.idxmax(axis=1, numeric_only=True)

             one       two gender
count   3.000000  2.000000      4
unique       NaN       NaN      2
top          NaN       NaN      M
freq         NaN       NaN      3
mean    3.083333 -2.900000    NaN
std     3.493685  2.262742    NaN
min     0.750000 -4.500000    NaN
25%     1.075000 -3.700000    NaN
50%     1.400000 -2.900000    NaN
75%     4.250000 -2.100000    NaN
max     7.100000 -1.300000    NaN

### Correlation and covariance

Correlation and covariance can be computed in a few ways:
- Between a pair of two series: `df['series1'].corr(df['series2'])`
- Correlation matrix: `df.corr(numeric_only=True)`
- Correlation of all columns with one series `df.corrwith(series)`

In [125]:
df['one'].cov(df['two'])
df.corr(numeric_only=True)

     one  two
one  1.0 -1.0
two -1.0  1.0

In [127]:
rng = np.random.default_rng(42)
df = pd.DataFrame(rng.standard_normal((4,3)),
                columns=list("abc"),
                index=['NY', 'NJ', 'CT', 'MA'])
df.corr()
df.corrwith(df['a'])

a    1.000000
b   -0.986433
c   -0.777498
dtype: float64

In [128]:
df = pd.DataFrame(
    [[1.4, np.nan, 'M'], [7.1, -4.5, 'F'], [np.nan, np.nan, 'M'], [0.75, -1.3, 'M']],
    index=["a", "b", "c", "d"],
    columns=["one", "two", "gender"],
)
df

    one  two gender
a  1.40  NaN      M
b  7.10 -4.5      F
c   NaN  NaN      M
d  0.75 -1.3      M

In [138]:
# unique value
unique_gender = df['gender'].unique()
unique_gender # array(['M', 'F'], dtype=object)

# Frequency table with value_counts()
df['gender'].value_counts()

# checking for membership with isin, which can be used as a filter
mask = df['gender'].isin(['M'])
mask
df[mask]

# get_indexer
genders = pd.Series(['M', 'F', 'O'])
indices = pd.Index(genders).get_indexer(df['gender'])
indices

array([0, 1, 0, 0])

In [139]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [142]:
# Frequency table for col Qu1
data['Qu1'].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [145]:
# Frequency table for all cols
freq_table = data.apply(pd.value_counts, axis=0).fillna(0)
freq_table

C:\Users\yluo\AppData\Local\Temp\ipykernel_27892\1441218696.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  freq_table = data.apply(pd.value_counts, axis=0).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [147]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64